We want to import a MySQL database into pandas dataframe 

For this, we would install sqlalchemy and PyMySQL and import them

In [1]:
import pandas as pd       
import sqlalchemy    
import pymysql

In [2]:
# Create engine format, you can get the documentation to connect to other database sources
# engine = sqlalchemy.create_engine('mysql+pymysql://username:password@host:port/mysql database name')

engine = sqlalchemy.create_engine('mysql+pymysql://root:DataScience7@127.0.0.1:3306/ezedb')

In [3]:
# Lets pass the engine into our pandas dataframe as well as the name of the database table in from MySQL

df = pd.read_sql_table("consumers",engine)
df

   id    name  phone_number
0   1  Donald    7326784567
1   2    Bill    6573489999
2   3    Modi    4567895646

In [5]:
# To read only name and phone number column;
    
df = pd.read_sql_table("consumers",engine, columns=['name','phone_number'])
df

     name  phone_number
0  Donald    7326784567
1    Bill    6573489999
2    Modi    4567895646

In [6]:
# Lets read another table from ezedb in MySQL into our pandas dataframe

df = pd.read_sql_table("orders",engine)
df

   id          name  amount  customer_id
0   1      Yoga Mat      20            2
1   2  Google Pixel     950            1
2   3  Fossil Watch     120            3

In [7]:
# SQL queries from MySQL workbench can also be run in pandas dataframe;

query = '''
SELECT consumers.name, consumers.phone_number, orders.name, orders.amount
 FROM consumers INNER JOIN orders
 ON consumers.id=orders.customer_id
'''

df = pd.read_sql_query(query,engine)
df

     name  phone_number          name  amount
0    Bill    6573489999      Yoga Mat      20
1  Donald    7326784567  Google Pixel     950
2    Modi    4567895646  Fossil Watch     120

In [8]:
# lets read and load our customers.csv file into our dataframe

df1 = pd.read_csv('customers.csv')
df1

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [9]:
# Lets rename the dataframe columns to be the same as the one from MySQL

df1.rename(columns={
    'Customer Name':'name',
    'Customer Phone':'phone_number'
}, inplace=True)
df1

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

In [12]:
# Write records stored in a dataframe to SQL database. We can also display the output here to see how it looks.

df1.to_sql(
    name="consumers",
    con=engine,                             # to avoid writing the index (0 to 5) to MySQL table
    index=False,
    if_exists="append"                       # I am writing the records into my consumer table
)
engine.execute("SELECT * FROM consumers").fetchall()

[(1, 'Donald', 7326784567),
 (2, 'Bill', 6573489999),
 (3, 'Modi', 4567895646),
 (4, 'rafael nadal', 4567895647),
 (5, 'maria sharapova', 434534545),
 (6, 'vladimir putin', 89345345),
 (7, 'kim un jong', 123434456),
 (8, 'jeff bezos', 934534543),
 (9, 'rahul gandhi', 44324222)]

In [13]:
pd.read_sql('consumers',engine)        # another way to read/display the sql table above

   id             name  phone_number
0   1           Donald    7326784567
1   2             Bill    6573489999
2   3             Modi    4567895646
3   4     rafael nadal    4567895647
4   5  maria sharapova     434534545
5   6   vladimir putin      89345345
6   7      kim un jong     123434456
7   8       jeff bezos     934534543
8   9     rahul gandhi      44324222

In [15]:
query = '''
SELECT consumers.name, consumers.phone_number, orders.name, orders.amount
 FROM consumers INNER JOIN orders
 ON consumers.id=orders.customer_id
'''

pd.read_sql(query,engine)

     name  phone_number          name  amount
0    Bill    6573489999      Yoga Mat      20
1  Donald    7326784567  Google Pixel     950
2    Modi    4567895646  Fossil Watch     120